# Python

## Import Packages
pandas and np資料前處理
sklearn 拿來切分資料集還有把一些東西encode<br>

In [40]:
import pandas as pd
import numpy as np
from sklearn import preprocessing, metrics
from sklearn.model_selection import train_test_split

## 讀檔

In [41]:
titanic_df = pd.read_csv('Titanic.csv')  
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [42]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## nanmedian
find the median of age ignoring nan values

In [43]:
age_median = np.nanmedian(titanic_df["Age"])
print("age median: ",age_median)

age median:  28.0

## 將空值取代
空值會變成median

In [ ]:
new_Age = np.where(titanic_df["Age"].isnull(), age_median, titanic_df["Age"])
#print(new_Age)
titanic_df['Age'] = new_Age

## 把passengerid 跟cabin丟掉

In [45]:
titanic_df = titanic_df.drop(['PassengerId' , 'Cabin'],axis = 1)

## 把有空值得丟掉

In [46]:
titanic_df = titanic_df.dropna()

## encode一下 前幾個禮拜做過很多次了 不用再解釋了

In [47]:
label_encoder = preprocessing.LabelEncoder()
encoded_Name = label_encoder.fit_transform(titanic_df['Name'])
titanic_df['Name'] = encoded_Name
encoded_Sex = label_encoder.fit_transform(titanic_df['Sex'])
titanic_df['Sex'] = encoded_Sex
encoded_Ticket = label_encoder.fit_transform(titanic_df['Ticket'])
titanic_df['Ticket'] = encoded_Ticket
encoded_Embarked = label_encoder.fit_transform(titanic_df['Embarked'])
titanic_df['Embarked'] = encoded_Embarked

## 純粹自己檢查用的

In [48]:
titanic_df.head()

   Survived  Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Embarked
0         0       3   108    1  22.0      1      0     522   7.2500         2
1         1       1   190    0  38.0      1      0     595  71.2833         0
2         1       3   353    0  26.0      0      0     668   7.9250         2
3         1       1   272    0  35.0      1      0      48  53.1000         2
4         0       3    15    1  35.0      0      0     471   8.0500         2

## 切分attribute跟 label

In [49]:
x=titanic_df.loc[:,['Pclass','Name','Age','SibSp','Parch','Ticket','Fare','Embarked']]
y=titanic_df.loc[:,['Survived']]

## 切分test train

In [50]:
train_X, test_X, train_y, test_y = train_test_split(x, y, test_size = 0.33)

## 開始learn一下

In [51]:
from sklearn.linear_model import LogisticRegression as LR
clf = LR(solver = 'liblinear').fit(train_X , train_y)

C:\Users\William\Anaconda3\lib\site-packages\sklearn\utils\validation.py:761: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

## 跑效果如何出來

In [52]:
predicted_test = clf.predict(test_X)
accuracy_test = metrics.accuracy_score(predicted_test, test_y)
print('accuracy: ',accuracy_test)

clf.score(test_X,test_y)

accuracy:  0.7585034013605442

0.7585034013605442